doc/BUILD/source/_static/soap_outputs/6.2.314.3321/deploy_action_simple_against_windows_computers_step_6_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <action>
          <comment>Created by PyTan v2.1.0</comment>
          <status>0</status>
          <distribute_seconds>0</distribute_seconds>
          <start_time>2015-09-05T05:20:01</start_time>
          <id>-1</id>
          <expire_seconds>3300</expire_seconds>
          <name>API Deploy Distribute Tanium Standard Utilities</name>
          <package_spec>
            <expire_seconds>3300</expire_seconds>
            <display_name>Distribute Tanium Standard Utilities</display_name>
            <name>Distribute Tanium Standard Utilities</name>
            <verify_group_id>0</verify_group_id>
            <last_modified_by>Jim Olsen</last_modified_by>
            <last_update>2015-08-07T11:46:35</last_update>
            <hidden_flag>1</hidden_flag>
            <command>cmd /c cscript install-standard-utils.vbs "Tools\StdUtils"</command>
            <command_timeout>2700</command_timeout>
            <id>20</id>
          </package_spec>
          <target_group>
            <filters>
              <filter>
                <not_flag>0</not_flag>
                <value>.*Windows.*</value>
                <operator>RegexMatch</operator>
                <sensor>
                  <hash>45421433</hash>
                </sensor>
              </filter>
            </filters>
          </target_group>
        </action>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>